# RevitAPIEventArgs Properties

---
The RevitAPIEventArgs type exposes the following members.
| Name| Description
---|---|---
| Cancellable|  Indicates whether an event may be cancelled by an event delegate.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace